#name = input("What is your name: ")
#print("your name is " + name)

""" პირველ ხაზზე დავადეკლარირე ცვლადი სახელად name და მივანიჭე მას 
მნიშვნელობა input("What is your name")  
input()-ში მოცემული ტექსტი გამოვა ტერმინალში 
და რასაც შევიყვან ტერმინალში ეგ ინფორმაცია ჩაჯდება name ცვლადის მნიშვნელობად 
და შედეგ გამოვიძახე ეს ცვლადი და გამოვიტანე მისი მნიშვნელობა print ფუნქციის 
საშუალებით """

#name = "gigi"
#print(name)

""" პირველ ხაზზე დავადეკლარირე სტრინგ ტიპის ცვლადი სახელად name რომელსაც 
მივანიჭე მნიშვნელობა gigi ხოლო შემდგომ ეს ცვლადი გამოვიძახე და გამოვიტანე
 მისი მნიშვნელობა print ფუნქციის დახმარებით """

#age = input("What is your age")
#print("your age is " + 5)

""" ამ კოდში მივიღებ Error-ს რადგან "your naem is " არის
სტრინგი და 5 არის ინტეჯერი მაგრამ თუ კოდს დავწერ შემდეგ ნაირად: """

#print("your name is " + age)

""" აქ კოდი სწორია რადგან age ცვლადში ტერმინალიდან შევიყვანე 
ინფორმაცია ამ შემთხვევაში ეს ინფორმაცია იყო რიცხვი მაგრამ კომპიუტერი
ამას აღიქვამს ისე როგორც სტრინგს და არა როგორც ინტეჯერს ამიტომ არ 
მივიღებ ამ კოდიდან Error-ს """

#num1 = input("Please enter number1: ")
#num2 = input("Please enter number2: ")

#print(num1 + num2)

""" 34-ე ხაზში მათემატიკური მოქმედების ნაცვლად ხდება უბრალოდ ორი სიტყვის
შეერთება რდგან input() ფუნქციაში რაც არ უნდა შვიტანოთ ტერმინალიდან საბოლოოდ
ყველაფერი შედის როგორც სტრინგის მნიშვნელობა რადგან ტერმინალში შეგვიძლია 
მხოლოდ სიმბოლოების გამოტანა ამიტომ ტერმინალში შეტანილი რიცხვიც კი 
გარდაიქმნება სტრინგად"""

#print(int("5") + 5)

""" int("5") ეს ფუნქცია ბრჭყალებში მოქცეულ რიცხვს აბრუნებს როგორც 
ინტეჯერს და 42-ე ხაზზე დაწერილი კოდი ტერმინალში გამოგვიტანს უკვე მათემატიკურ
მოქმედებას რადგან ინტეჯერს ემატება ინტეჯერი """

#print(int("Gigi") + 5)

""" აქ უკვე არის Error რადგან int() ფუნქციას მხოლოდ და მხოლოდ შეუძლია
მიიღოს ისეტი სიმბოლოები რომლებიც არის რიცხვები  """


num1 = input("Enter first number: ")
num2 = input("Enter second number: ")
num3 = input("Enter third number: ")

print("Multiplied is " + str(int(num1) * int(num2) * int(num3)))

""" პირველ, მეორე და მესამე ხაზზე დავადეკლარირე ცვლადი სახელად num1, num2 და
num3 მივანიჭე მათ მნიშვნელობა:
num1 = input("Enter first number: ")
num2 = input("Enter second number: ")
num3 = input("Enter third number: ")
input()-ში მოცემული ტექსტი გამოვა ტერმინალში 
და რასაც შევიყვან ტერმინალში ეგ ინფორმაცია ჩაჯდება num1, num2 და num3
ცვლადის მნიშვნელობად. შემდეგ გავამრავლე ეს ცვლადები ერთმანეთზე მაგრამ
რადგან კომპიუტერი ტერმინალში შეტანილ ინფორმაციას აღიქვამდა როგორც სტრინგს
გამოვიყენე int() ფუნქცია და ვაქციე სამივე ცვლადი ინტეჯერად მაგრამ კოდს
ქონდა Error რადგან "Multiplied is" არის სტრინგი და სტრინგს ვერ დავუმატებთ
ინტეჯერს ამიტომ სამივე ცვლადი რომელიც ვაქციეთ ინტეჯერად ამშემთხვევაში
ვაქციეთ სტრინგად რომ მიღებული პასუხი ამ სამივე რიცხვის გამრავლების შემდგომ და
"Multiplies is " შეერთებულიყო """

name = input("Please enter your name: ")
last_name = input("Please enter your lastname: ")
age = input("Please enter your age: ")
introduction = "Hello I am " + name + " " + last_name + " " "I am" + " " + age + " " + "years old"
print(introduction)

""" პირველ, მეორე და მესამე ხაზზე დავადეკლარირე ცვლადი სახელად name, last_name
და age მივანიჭე მათ მნიშვნელობა: 
name = input("Please enter your name: ")
last_name = input("Please enter your lastname: ")
age = input("Please enter your age: ") 
ამის შემდგომ დავადეკლარირე ცვლადი რომელიც შემიდგენდა მთლიან ტექსტს და 
დავარქვი მას introduction და მივანიჭე მნიშვნელობა: 
introduction = "Hello I am " + name + " " + last_name + " " "I am" + " " + age + " " + "years old 
ხოლო შემდგომ ეს ცვლადი გამოვიძახე და გამოვიტანე მისი მნიშვნელობა print 
ფუნქციის დახმარებით """ 
