def find_last_even(numbers_list):
    for i in range(len(numbers_list) -1, -1, -1):
        if numbers_list[i] % 2 == 0:
            return numbers_list[i]

print(find_last_even([1,2,3,4,5]))


''' პირველ რიგში შევქმენით ფუნქცია რომელსაც დავარქვით find_last_even და
არგუმნტად მივეცით numbers_list. შემდეგ len ფუქნქციის საშუალებით გავიგეთ
numbers_list_ის ზომას შემდეგ ვწერთ ინდექსებს რომლის საშუალებითაც 
შემოვაბრუნებთ სიას ბოლო რიცხვის ინდექსი არის -1 ამის შემდეგ წავიდეს
ნული ინდექსის ჩათვლით ანუ -1 მდე და ყოველ გამეორებაზე მოაკლდეს 1 ამიტომ
ვწერთ -1. შემდეგ if ის საშუალებით ვამოწმებთ number_list ში არსებული
რიცვები არის თუ არა ლუწი ამისთვის გამოვიყენეთ ნაშთიანი გაყოფა. და
თუ ეს if ვარიანტი იქნებოდა გამართლებული უნდა დაებრუნებინა number_list 
იდან ბოლო ლუწი რიცხვი '''